In [2]:
# imports
import warnings
warnings.filterwarnings("ignore")

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from datetime import datetime
from sklearn.metrics import mean_squared_error
from math import sqrt 

import statsmodels.api as sm
from statsmodels.tsa.api import Holt

# default viz settings
plt.rc('figure', figsize=(10, 8))
plt.rc('font', size=14)
plt.rc('lines', linewidth=2, c='m')
plt.style.use('seaborn-whitegrid')

In [26]:
# get stock data
from vega_datasets import data
stocks = data.stocks()
# to transform such that each symbol is it's own column and each row is one month
stocks.pivot_table('price', 'date', 'symbol')

symbol        AAPL    AMZN    GOOG     IBM   MSFT
date
2000-01-01   25.94   64.56     NaN  100.52  39.81
2000-02-01   28.66   68.87     NaN   92.11  36.35
2000-03-01   33.95   67.00     NaN  106.11  43.22
2000-04-01   31.01   55.19     NaN   99.95  28.37
2000-05-01   21.00   48.31     NaN   96.31  25.45
...            ...     ...     ...     ...    ...
2009-11-01  199.91  135.91  583.00  125.79  29.27
2009-12-01  210.73  134.52  619.98  130.32  30.34
2010-01-01  192.06  125.41  529.94  121.85  28.05
2010-02-01  204.62  118.40  526.80  127.16  28.67
2010-03-01  223.02  128.82  560.19  125.55  28.80

[123 rows x 5 columns]

In [ ]:
I just want to focus on IBM.

In [27]:
IBM = pd.DataFrame(stocks[stocks['symbol'] == 'IBM'])
IBM = stocks.pivot_table('price', 'date')
IBM

               price
date
2000-01-01   57.7075
2000-02-01   56.4975
2000-03-01   62.5700
2000-04-01   53.6300
2000-05-01   47.7675
...              ...
2009-11-01  214.7760
2009-12-01  225.1780
2010-01-01  199.4620
2010-02-01  201.1300
2010-03-01  213.2760

[123 rows x 1 columns]

In [28]:
IBM.isna().sum()

price    0
dtype: int64

I'll remove leap days later if I have time.